Repository: mikeozornin/recipe-scaler-native
Catalog: RecipeScalerNative/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# shopping.copy-as-text
source: Copy as text
ru: Скопировать текстом

# shopping.copy-link
source: Copy link
ru: Скопировать ссылку

# shopping.copy-text-misc
source: Other
ru: И еще

# shopping.copy-text-untitled-recipe
source: Recipe
ru: Рецепт

# shopping.detail-add-all
source: Add to shopping list
ru: В список покупок

# shopping.empty-to-buy
source: Your shopping list is empty
ru: В списке покупок пока пусто

# shopping.empty-to-buy-all-done
source: All done. Happy cooking!
ru: Все куплено. Удачной готовки!

# shopping.ingredient-add
source: Add to list
ru: В список

# shopping.items-added.few
source: %d items added
ru: %d покупки добавлено

# shopping.items-added.many
source: %d items added
ru: %d покупок добавлено

# shopping.items-added.one
source: %d item added
ru: %d покупка добавлена

# shopping.link-copied
source: Link copied
ru: Ссылка скопирована

# shopping.mark-not-purchased
source: Mark not purchased
ru: Вернуть в список

# shopping.mark-purchased
source: Mark purchased
ru: Отметить купленным

# shopping.no-items-to-add
source: Nothing to add from this recipe
ru: В этом рецепте нечего добавить

# shopping.public-link-title
source: Public link
ru: Публичная ссылка

# shopping.reminders-tip.enable
source: Enable
ru: Включить

# shopping.reminders-tip.message
source: By the way, you can sync your shopping list with Apple Reminders
ru: Кстати, покупки можно синхронизировать с Apple Reminders

# shopping.section.purchased
source: Purchased
ru: Куплено

# shopping.section.to-buy
source: To buy
ru: Купить

# shopping.share-button
source: Share
ru: Поделиться

# shopping.share-update-error
source: Could not update share settings
ru: Не удалось обновить настройки

# shopping.sort
source: Sort
ru: Сортировка

# shopping.sort.az
source: A–Z
ru: А–Я

# shopping.sort.by-recipe
source: By recipe
ru: По рецепту

# shopping.text-copied
source: List copied
ru: Список скопирован

# shopping.title
source: Shopping list
ru: Список покупок

# spotlight.action.addToShopping.title
source: Add to Shopping
ru: Добавить в покупки

source: Start timer
ru: Запустить таймер

# sync.error.empty-update
source: Sync failed. The recipe will be reloaded.
ru: Сбой синхронизации. Рецепт будет перезагружен.

# sync.error.generic
source: Sync error. The recipe will be reloaded.
ru: Ошибка синхронизации. Рецепт будет перезагружен.

# sync.error.invalid-update
source: Sync failed. The recipe will be reloaded.
ru: Сбой синхронизации. Рецепт будет перезагружен.

# sync.error.ownership
source: You do not have permission to edit this recipe.
ru: Нет прав на редактирование этого рецепта.

# sync.error.recipe-deleted
source: This recipe was deleted.
ru: Этот рецепт удалён.

# sync.error.truncated-collection
source: Collection was out of sync with the server. Reloading.
ru: Коллекция рассинхронизировалась с сервером. Перезагружаем.

# sync.status.a11y.images
source: Full images cached %lld of %lld
ru: Полные фото в кэше %lld из %lld

# sync.status.a11y.recipes
source: Recipe data cached %lld of %lld
ru: Данные рецептов в кэше %lld из %lld

# sync.status.badge.recipe
source: Recipe
ru: Рецепт

# sync.status.connection.retry
source: Try reconnecting
ru: Повторить подключение

# sync.status.images.downloading
source: Downloading recipes: %lld of %lld…
ru: Загрузка рецептов: %lld из %lld…

# sync.status.images.full
source: Full images (offline detail)
ru: Полные фото (офлайн в деталке)

# sync.status.images.hint.offline
source: Offline: %lld full images not cached yet. Connect to download.
ru: Офлайн: не в кэше %lld полных фото. Подключитесь для загрузки.

# sync.status.images.hint.online
source: Some images are still downloading or failed. Tap Retry below.
ru: Часть фото ещё качается или не загрузилась. Нажмите «Повторить» ниже.

# sync.status.images.none
source: No recipes with photos in the collection.
ru: В коллекции нет рецептов с фото.

# sync.status.images.preview
source: List thumbnails
ru: Превью в списке

# sync.status.images.ready
source: All images cached for offline use
ru: Все фото в кэше для офлайна

# sync.status.images.retry
source: Download missing images
ru: Докачать фото

# sync.status.pending.more
source: …and %lld more
ru: …и ещё %lld

# sync.status.recipes.cached
source: Cached locally
ru: В локальном кэше

# sync.status.recipes.downloading
source: Downloading recipe data %lld/%lld…
ru: Загрузка данных рецептов %lld/%lld…

# sync.status.recipes.hint.offline.few
source: %d recipes are not available offline. Connect to sync them.
ru: %d рецепта недоступны офлайн. Подключитесь к сети для загрузки.

# sync.status.recipes.hint.offline.many
source: %d recipes are not available offline. Connect to sync them.
ru: %d рецептов недоступны офлайн. Подключитесь к сети для загрузки.

# sync.status.recipes.hint.offline.one
source: %d recipe is not available offline. Connect to sync it.
ru: %d рецепт недоступен офлайн. Подключитесь к сети для загрузки.

# sync.status.recipes.hint.online
source: Recipe data will download in the background.
ru: Данные рецептов загружаются в фоне.

# sync.status.recipes.none
source: No recipes in the collection yet.
ru: В коллекции пока нет рецептов.

# sync.status.recipes.ready
source: All recipe data cached for offline use
ru: Все рецепты сохранены для офлайна

# sync.status.recipes.retry
source: Retry recipe download
ru: Повторить загрузку рецептов

# sync.status.section.connection
source: Sync
ru: Синхронизация

# sync.status.section.images
source: Image cache
ru: Кэш изображений

# sync.status.section.pending
source: Not cached yet
ru: Ещё не в кэше

# sync.status.section.recipes
source: Recipe data (offline)
ru: Данные рецептов (офлайн)

# sync.status.section.recipes.pending
source: Recipes not cached yet
ru: Рецепты ещё не в кэше

# sync.status.title
source: Sync & offline
ru: Синхронизация и офлайн

# sync.status.transport.label
source: Transport
ru: Транспорт

# sync.status.transport.polling
source: HTTP + WebSocket
ru: HTTP + сокет

# sync.status.transport.websocket
source: WebSocket
ru: Сокет

# telegram.accordion-title
source: Telegram
ru: Телеграм

# telegram.benefits-description-1
source: After connecting your Telegram account, you can easily save recipes from Telegram
ru: После подключения телеграм-аккаунта вы сможете легко сохранять рецепты из Telegram

# telegram.connect
source: Connect
ru: Подключить

# telegram.connected
source: Connected
ru: Подключен

# telegram.copy-code
source: Copy connection command
ru: Скопировать команду подключения

# telegram.disconnect
source: Disconnect
ru: Отключить

# telegram.failed-to-disconnect
source: Failed to disconnect account
ru: Не удалось отключить аккаунт

# telegram.failed-to-get-code
source: Failed to get connection code
ru: Не удалось получить код подключения

# telegram.refresh-code
source: Generate new connection code
ru: Получить новый код подключения

# telegram.status-failed
source: Failed to load Telegram status
ru: Не удалось получить статус Telegram

# terms.link
source: Terms of Use (EULA)
ru: Условия использования (EULA)

source: The camera couldn't be accessed. It might be in use by another app.
ru: Не удалось получить доступ к камере. Возможно, она используется другим приложением.

# timer.delete
source: Delete timer
ru: Удалить таймер

# timer.example.active-timers
source: Active Timers (%d)
ru: Активные таймеры (%d)

# timer.example.all-timers
source: All Timers (%d)
ru: Все таймеры (%d)

# timer.example.no-active-timers
source: No active timers
ru: Нет активных таймеров

# timer.example.no-timers
source: No timers created yet
ru: Таймеров ещё нет

# timer.example.seconds.few
source: %d seconds
ru: %d секунды

# timer.example.seconds.many
source: %d seconds
ru: %d секунд

# timer.example.seconds.one
source: %d second
ru: %d секунда

# timer.example.title
source: Timer Manager
ru: Менеджер таймеров

# timer.intent.default-name
source: Cooking timer
ru: Кулинарный таймер

# timer.intent.dialog.hours-and-minutes
source: Timer set for %@ and %@.
ru: Таймер установлен на %@ и %@.

# timer.intent.dialog.hours-only
source: Timer set for %@.
ru: Таймер установлен на %@.

# timer.intent.dialog.minutes-only
source: Timer set for %@.
ru: Таймер установлен на %@.

# timer.intent.error.zero-duration
source: Please specify at least 1 minute or 1 hour.
ru: Укажите хотя бы 1 минуту или 1 час.

# timer.intent.hours.few
source: %d hours
ru: %d часа

# timer.intent.hours.many
source: %d hours
ru: %d часов

# timer.intent.hours.one
source: %d hour
ru: %d час

# timer.intent.intent.description
source: Starts a countdown timer in Recipe Scaler.
ru: Запускает таймер обратного отсчёта в Recipe Scaler.

# timer.intent.intent.title
source: Start a cooking timer
ru: Запустить кулинарный таймер

# timer.intent.minutes.few
source: %d minutes
ru: %d минуты

# timer.intent.minutes.many
source: %d minutes
ru: %d минут

# timer.intent.minutes.one
source: %d minute
ru: %d минуту

# timer.intent.parameter.hours.description
source: Number of hours to count down.
ru: Количество часов обратного отсчёта.

# timer.intent.parameter.minutes.description
source: Number of minutes to count down.
ru: Количество минут обратного отсчёта.

# timer.intent.parameter.name
source: Timer name
ru: Название таймера

# timer.intent.parameter.name.description
source: Label for the timer.
ru: Название таймера.

# timer.intent.preset-10min.description
source: Starts a 10-minute countdown timer in Recipe Scaler.
ru: Запускает 10-минутный таймер обратного отсчёта в Recipe Scaler.

# timer.intent.preset-10min.title
source: Start a 10-minute timer
ru: Запустить таймер на 10 минут

# timer.notification.action.add-five-minutes
source: +5 minutes
ru: +5 минут

# timer.notification.action.add-minute
source: +1 minute
ru: +1 минута

# timer.notification.action.delete
source: Delete
ru: Удалить

# timer.notification.body
source: Go and check what you're cooking
ru: Проверьте, что вы там готовите

# timer.notification.title
source: Timer "%@" completed!
ru: Таймер «%@» завершен!

# timer.toggle.overdue
source: Overdue
ru: Просрочен

# timer.toggle.pause
source: Pause
ru: Пауза

# timer.toggle.resume
source: Resume
ru: Продолжить

# timer.toggle.start
source: Start
ru: Запустить

source: Timers
ru: Таймеры

# timers.rename
source: Rename
ru: Переименовать

# timers.start
source: Start timer
ru: Запустить таймер

# timers.time-types.hours
source: Hours
ru: Часы

# timers.time-types.minutes
source: Minutes
ru: Минуты

# timers.time-types.seconds
source: Seconds
ru: Секунды

# timers.timer-name
source: New name
ru: Новое название

# timers.unlink
source: Unlink
ru: Отлинковать

# timers.unlink-from-value
source: Unlink from value
ru: Отлинковать от значения

source: To scan QR codes, please allow camera access in Settings.
ru: Разрешите доступ к камере в настройках для сканирования QR-кодов.

source: Try Again
ru: Повторить

# vkusvill.assistant-prompt
source: Build a Vkusvill cart from my shopping list
ru: Собери корзину во Вкусвилле из моего списка покупок

# vkusvill.buy-button
source: Buy at Vkusvill
ru: Купить во Вкусвилле

# vkusvill.offline
source: Unavailable offline
ru: Недоступно офлайн

# vkusvill.settings-title
source: Vkusvill
ru: Вкусвилл

# vkusvill.settings-toggle-title
source: Connect to Vkusvill
ru: Подключение ко Вкусвиллу

# watch.timer.action.delete
source: Delete
ru: Удалить

# watch.timer.action.pause
source: Pause
ru: Пауза

# watch.timer.action.resume
source: Resume
ru: Продолжить

# watch.timer.empty.title
source: No timers
ru: Таймеров нет

# watch.timer.error.subtitle
source: Check connection and try later
ru: Проверьте соединение и попробуйте позже

# watch.timer.error.title
source: Not connected to phone
ru: Не подключено к телефону

# watch.timer.not-authorized.title
source: Sign in to Recipe Scaler on iPhone to see timers
ru: Войдите в Recipe Scaler на iPhone, чтобы видеть таймеры

# watch.timer.notification.body
source: Go and check what you're cooking
ru: Проверьте, что вы готовите

# watch.timer.notification.title
source: Timer completed
ru: Таймер завершён

# watch.timer.settings.expiry-toggle.hint
source: Vibrate when a timer expires
ru: Вибрировать при окончании таймера

# watch.timer.settings.expiry-toggle.label
source: Haptics on completion
ru: Вибрация при окончании

# watch.timer.settings.hint
source: Open settings
ru: Открыть настройки

# watch.timer.settings.label
source: Settings
ru: Настройки

# watch.timer.settings.notifications-disabled.footnote
source: To re-enable, open Watch Settings → Notifications → Recipe Scaler.
ru: Чтобы включить, откройте «Настройки часов» → «Уведомления» → Recipe Scaler.

# watch.timer.settings.title
source: Settings
ru: Настройки

source: We couldn't find a camera on your device.
ru: На устройстве не найдена камера.

# widgets.timer.description
source: Active cooking timers
ru: Активные таймеры

# widgets.timer.empty
source: No active timers
ru: Таймеров нет

source: Your recipes will appear here
ru: Здесь появятся ваши рецепты

# yrs.error.apply-failed
source: Failed to apply the update
ru: Не удалось применить обновление

# yrs.error.technical
source: A technical error occurred. Please try again.
ru: Произошла техническая ошибка. Попробуйте ещё раз.

# yrs.error.transaction
source: Failed to open a document transaction
ru: Не удалось открыть транзакцию документа
